Repository: 84000/data-translation-memory
Catalog: Toh_103-The_Teaching_by_the_Child_Inconceivable_Radiance-v2.tmx
Source language: bo
Languages: en

source: བྱང་ཆུབ་སེམས་དཔའ་དྲུག་ཅུ་ནི་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཐོབ་པར་གྱུར་ཏོ། །
en: Sixty bodhisattvas developed acceptance of the fact that phenomena do not arise.

source: ཉན་ཐོས་ལྔ་བརྒྱ་ནི་ལེན་པ་མེད་པར་ཟག་པ་རྣམས་ལས་སེམས་རྣམ་པར་གྲོལ་ལོ། །
en: Five hundred listeners completely freed their minds from defilement, without any further grasping.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ལ་བཀའ་སྩལ་པ།
en: The Bhagavān then said to venerable Ānanda:

source: ཀུན་དགའ་བོ་ཁྱོད་ཀྱིས་ངའི་དམ་པའི་ཆོས་ཡོངས་སུ་གཟུང་བ་དང་།
en: “Ānanda, you must retain my sacred Dharma.

source: ད་ལྟར་དང་། མ་འོངས་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་ཕན་གདགས་པའི་ཕྱིར་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཟུང་ཤིག །
en: For the benefit of present bodhisattvas, and for those yet to come, you must retain this account of Dharma.”

source: ཀུན་དགའ་བོས་གསོལ་པ། བཅོམ་ལྡན་འདས་བདག་གིས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་གཟུང་ལགས་ན།
en: Ānanda replied, “Bhagavān, when I retain this account of Dharma,

source: ཆོས་ཀྱི་རྣམ་གྲངས་འདིའི་མིང་ཅི་ལགས།
en: what is the name of this account of Dharma?

source: འདི་ཇི་ལྟར་གཟུང་བར་བགྱི།
en: How shall it be remembered?”

source: འདི་ལས་ཀྱི་སྒྲིབ་པ་རྣམ་པར་སྦྱོང་བ་ཞེས་བྱ་བ་དང་། སངས་རྒྱས་རྣམ་པར་རོལ་པ་ཞེས་བྱ་བ་དང་། སྣང་བ་བསམ་གྱིས་མི་ཁྱབ་པས་བསྟན་པ་ཞེས་བྱ་བར་ཟུང་ཤིག །
en: “Retain it as The Cleansing of the Obscurations of Karma and The Buddha’s Pageantry and The Teaching by Inconceivable Radiance.

source: ཀུན་དགའ་བོ་གང་ལ་ལ་ཞིག་གིས་ཇི་སྲིད་འཚོའི་བར་དུ་དེ་བཞིན་གཤེགས་པ་བཞུགས་པ་ལ་བསྟི་སྟང་བྱེད། བླ་མར་བྱེད། རི་མོར་བྱེད། མཆོད་པར་བྱེད་ཅིང་། མེ་ཏོག་གི་ཕུར་མ་རི་རབ་ཙམ་གཏོར་བ་དང་། སྤོས་དང་། ཕྱེ་མ་དང་། བྱུག་པ་དང་། གོས་དང་། གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་དང་། ལྷའི་དང་མིའི་མཆོད་པ་རྣམ་པ་མང་པོ་གཞན་དག་གིས་མཆོད་པ་བས།
en: “Ānanda, some people may spend their entire lives respecting, revering, venerating, and worshiping all the tathāgatas, offering them ground floral incense strewn as high as Mount Meru, as well as fragrances, powders, balms, robes, parasols, victory banners, and pennants, and also many other varieties of divine and human offerings.

source: རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་གང་ཞིག་སྣང་བ་བསམ་གྱིས་མི་ཁྱབ་པས་བསྟན་པའི་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་འཛིན་ཅིང་ཀློག་ལ། ཀུན་ཆུབ་པར་བྱེད་ཅིང་། གཞན་དག་ལ་ཡང་རྒྱ་ཆེར་ཡང་དག་པར་སྟོན་ལ།
en: Compared to them, a noble son or daughter who retains and reads this account of Dharma taught by Inconceivable Radiance, who fully comprehends it and makes it widely and perfectly known to others,

source: དེ་བཞིན་དུ་ནན་ཏན་དུ་བྱེད་ན་འདི་ནི་བསོད་ནམས་ཀྱི་ཕུང་པོ་དེ་བས་ཆེས་མང་དུ་བསྐྱེད་དོ། །
en: and who likewise assiduously applies it—such a person generates a vastly greater collection of merit.

source: ཀུན་དགའ་བོ་དེ་ལྟ་བས་ན་དེ་བཞིན་གཤེགས་པ་ལ་ཆོས་ཀྱི་མཆོད་པས་མཆོད་པར་འདོད་པ་དང་།
en: “Ānanda, since that is the case, those who wish to honor the Tathāgata with the offering of Dharma and

source: ཤེས་རབ་ཀྱི་སྣང་བ་ཆེན་པོ་བྱེད་པར་འདོད་པས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་གཟུང་བར་བྱ།
en: those who wish to create the great radiance of insight should retain this account of Dharma,

source: བཀླག་པར་བྱ། ནན་ཏན་གྱིས་བསྒྲུབ་པར་བྱ། གཞན་དག་ལ་ཡང་རྒྱ་ཆེར་ཡང་དག་པར་རབ་ཏུ་བསྟན་པར་བྱའོ། །
en: read it, accomplish it with diligence, and make it widely and perfectly known to others.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་དེ་སྐད་ཅེས་བཀའ་སྩལ་ནས།
en: When the Bhagavān had spoken these words,

source: ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྣང་བ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་།
en: the venerable Ānanda, the bodhisattva mahāsattva Inconceivable Radiance,

source: ཡུལ་ཀོ་ས་ལའི་རྒྱལ་པོ་གསལ་རྒྱལ་འཁོར་དང་བཅས་པ་དང་།
en: the king of Kośala, Prasenajit, along with his entourage,

source: ལྷའི་དབང་པོ་བརྒྱ་བྱིན་དང་། མི་མཇེད་ཀྱི་བདག་པོ་ཚངས་པ་དང་། འཇིག་རྟེན་སྐྱོང་བ་བཞི་དང་།
en: the lord of gods Śakra, the master of the Sahā world system Brahmā, and the four guardians of the world,

source: ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་དེ་དང་། ལྷ་དང་། མི་དང་། ལྷ་མ་ཡིན་དང་། དྲི་ཟར་བཅས་པའི་འཇིག་རྟེན་ཡི་རངས་ཏེ།
en: along with everyone else in attendance as well as the gods, humans, asuras, and gandharvas of this world, rejoiced and

source: བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པ་ལ་མངོན་པར་བསྟོད་དོ། །
en: greatly extolled what the Bhagavān had said.

source: འཕགས་པ་ཁྱེའུ་སྣང་བ་བསམ་གྱིས་མི་ཁྱབ་པས་བསྟན་པ་ཞེས་བྱ་བ་ཆོས་ཀྱི་རྣམ་གྲངས་རྫོགས་སོ།། །།
en: This completes the noble account of Dharma, “The Teaching by the Child Inconceivable Radiance.”

source: རྒྱ་གར་གྱི་མཁན་པོ་སུ་རེན་དྲ་བོ་དྷི་དང་། ཞུ་ཆེན་གྱི་ལོཙྪ་བ་བན་དེ་ཡེ་ཤེས་སྡེས་བསྒྱུར་ཅིང་ཞུས་ཏེ་གཏན་ལ་ཕབ་པ།
en: The Indian preceptor Surendrabodhi and the chief translator-editor Bandé Yeshé Dé translated, corrected, and finalized this text.
